Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: B<NOTE:> In order to make things easier for programmers with experience with the Python or PCRE regex engines the pattern C<< (?P>NAME) >> may be used instead of C<< (?&NAME) >>.
es: B<NOTA:> para facilitar las cosas a los programadores con experiencia de uso de los motores de expresiones regulares de Python o PCRE, se puede usar el patrón C<< (?P>NOMBRE) >> en lugar de C<< (?&NOMBRE) >>.

source: B<NOTE:> In order to make things easier for programmers with experience with the Python or PCRE regex engines, the pattern C<< (?P=NAME) >> may be used instead of C<< \k<NAME> >>.
es: B<NOTA:> para facilitar las cosas a los programadores con experiencia de uso de los motores de expresiones regulares de Python o PCRE, se puede usar el patrón C<< (?P=NOMBRE) >> en lugar de C<< \k<NOMBRE> >>.

source: B<NOTE:> In order to make things easier for programmers with experience with the Python or PCRE regex engines, the pattern C<< (?PE<lt>NAMEE<gt>pattern) >> may be used instead of C<< (?<NAME>pattern) >>; however this form does not support the use of single quotes as a delimiter for the name.
es: B<NOTA:> con el fin de facilitar las cosas a los programadores con experiencia de uso de los motores de expresiones regulares de Python o PCRE, se puede usar el patrón C<< (?PE<lt>NOMBREE<gt>patrón) >> en lugar de C<< (?<NOMBRE>patrón) >>; sin embargo, esta forma no permite usar comillas simples como el delimitador del nombre.

source: B<NOTE:> While the notation of this construct is the same as the similar function in .NET regexes, the behavior is not.
es: B<NOTA:> si bien la notación de esta construcción es la misma que la de la función similar de las expresiones regulares en .NET, el comportamiento no lo es.

source: B<NOTE:> it is forbidden at the repository level to delete any of the "primary" branches.
es: B<NOTA:> está prohibido eliminar ramas "principales" de un repositorio.

source: B<NOTE>: Failed matches in Perl do not reset the match variables, which makes it easier to write code that tests for a series of more specific cases and remembers the best match.
es: B<NOTA>: en Perl las coincidencias fallidas no reinicializan las variables de coincidencia, lo que facilita escribir código que haga comprobaciones para una serie específica de casos y recuerde la mejor coincidencia.

source: B<NOTE>: that this output is also what you see as a template if you do not provide a message to C<git commit>.
es: B<NOTA>: este resultado también es la plantilla de lo que se ve si no se proporciona un mensaje a C<git commit>.

source: B<Note> that this pattern does not behave the same way as the equivalent PCRE or Python construct of the same form.
es: B<Tenga en cuenta> que este patrón no se comporta del mismo modo que la construcción equivalente de PCRE o Python.

source: B<Or>, if you aren't using cpan-mac, do some manual labor.
es: B<O bien>, si no usa cpan-mac, haga un poco de trabajo manual.

source: B<Or>, you can either use the shareware B<StuffIt Expander> program ( http://my.smithmicro.com/mac/stuffit/ ) or the freeware B<MacGzip> program ( http://persephone.cps.unizar.es/general/gente/spd/gzip/gzip.html ).
es: B<O bien>, puede utilizar el programa shareware B<StuffIt Expander> ( http://my.smithmicro.com/mac/stuffit/ ) o el programa gratuito B<MacGzip> ( http://persephone.cps.unizar.es/general/gente/spd/gzip/gzip.html ).

source: B<Or>, you can use the freeware B<suntar> or I<Tar> ( http://hyperarchive.lcs.mit.edu/HyperArchive/Archive/cmp/ ).
es: B<O bien>, puede utilizar el software gratuito B<suntar> o I<Tar> ( http://hyperarchive.lcs.mit.edu/HyperArchive/Archive/cmp/ ).

source: B<Outside of the file handle case, use of this syntax is discouraged, as it can confuse the Perl interpreter.
es: B<Salvo en el caso de los identificadores de archivo, se desaconseja el uso de esta sintaxis, ya que puede confundir al intérprete de Perl.

source: B<Polymorphism> is a fancy way of saying that objects from two different classes share an API.
es: El B<polimorfismo> es una forma elegante de decir que los objetos de dos clases distintas comparten una API.

source: B<RESTRICTION>: The conversions marked with C<(*)> above involve steps performed by the C compiler.
es: B<RESTRICCIÓN>: las conversiones anteriores marcadas con C<(*)> implican pasos ejecutados por el compilador de C.

source: B<Roles> are something that a class I<does>, rather than something that it I<is>.
es: Los B<roles> representan lo que la clase I<hace>, no lo que la clase I<es>.

source: B<Text strings>, or B<character strings> are made of characters.
es: Las B<cadenas de texto>, o B<cadenas de caracteres>, están constituidas por caracteres.

source: B<Those that are targeted at a specific platform.> (Such as the Win32:: modules.)
es: B<Los que se destinan a una plataforma específica> (como los módulos Win32::).

source: B<Those that need to be compiled, where the target platform doesn't have compilers readily available.> (These modules contain F<.xs> or F<.c> files, usually.)
es: B<Los que deben ser compilados, cuando la plataforma de destino no incluye compiladores>. (Estos módulos contienen, por lo general, archivos F<.xs> o F<.c>).

source: B<Those that should, but don't.> These need to be fixed; consider contacting the author and possibly writing a patch.
es: B<Los que deberían, pero no lo hacen>. Habría que arreglarlos; debe ponerse en contacto con el autor o incluso enviarle un parche.

source: B is a Unicode encoding.
es: B es una codificación de Unicode.

source: B<Unicode> is a character set with room for lots of characters.
es: B<Unicode> es un juego de caracteres en el que caben muchos caracteres.

source: B<WARNING:> These patterns are experimental and subject to change or removal in a future version of Perl.
es: B<ADVERTENCIA:> estos patrones son experimentales y están sujetos a cambios o a su eliminación en una versión futura de Perl.

source: B<WARNING:> This feature is highly experimental.
es: B<ADVERTENCIA:> esta característica es muy experimental.

source: B<WARNING>: Difficult material (and prose) ahead.
es: B<ADVERTENCIA>: el material que se expone a continuación es difícil, y también lo es la prosa usada para exponerlo.

source: B<WARNING>: In perl 5.12.x and earlier, the regex engine was not re-entrant, so interpolated code could not safely invoke the regex engine either directly with C<m//> or C<s///>), or indirectly with functions such as C<split>.
es: B<AVISO>: en perl 5.12.x y versiones anteriores no había reentrada en el motor de expresiones regulares, por lo que el código interpolado no podía invocar de forma segura el motor de expresiones regulares directamente con C<m//> o C<s///>, o indirectamente a través de funciones, como C<split>.

source: B<WARNING>: Once Perl sees that you need one of C<$&>, C<$`>, or C<$'> anywhere in the program, it has to provide them for every pattern match.
es: B<ADVERTENCIA>: cuando Perl considera que se necesita una de las variables C<$&>, C<$`> o C<$'> en cualquier parte del programa, las proporcionará cada vez que se busquen coincidencias de patrones.

source: B<WARNING>: Particularly complicated regular expressions can take exponential time to solve because of the immense number of possible ways they can use backtracking to try for a match.
es: B<ADVERTENCIA>: la resolución de expresiones regulares muy complicadas puede tardar un tiempo exponencial, por la inmensa cantidad de formas posibles de vuelta atrás existentes para lograr una coincidencia.

source: B<WARNING>: This extended regular expression feature is considered experimental, and may be changed without notice.
es: B<AVISO>: esta característica de expresión regular extendida se considera experimental y se puede modificar sin previo aviso.

source: B<WARNING>: Use of lexical (C<my>) variables in these blocks is broken.
es: B<AVISO>: el uso de variables léxicas (C<my>) en estos bloques no funciona correctamente.

source: B<perldoc> B<-L> fr B<-q> FAQ Keyword
es: B<perldoc> B<-L> es B<-q> I<palabra clave de perlfaq>

source: B<perldoc> B<-L> it B<-f> BuiltinFunction
es: B<perldoc> B<-L> it B<-f> I<función predefinida>

source: B<perldoc> B<-f> BuiltinFunction
es: B<perldoc> B<-f> I<función predefinida>

source: B<perldoc> B<-q> FAQ Keyword
es: B<perldoc> B<-q> I<palabra clave de perlfaq>

source: B<perldoc> B<-v> PerlVariable
es: B<perldoc> B<-v> I<variable de Perl>

source: B<perldoc> looks up a piece of documentation in .pod format that is embedded in the perl installation tree or in a perl script, and displays it via C<groff -man | $PAGER>.
es: B<perldoc> busca un elemento de documentación con formato .pod incluido en el árbol de instalación de perl o en un script perl, y ejecuta C<groff -man | $PAGER> para mostrarlo

source: B<piconv> is a Perl version of B<iconv>, a character encoding converter widely available for various Unixen today.
es: B<piconv> es una versión Perl de B<iconv>, un conversor de codificaciones de caracteres de uso muy extendido en el mundo Unix.

source: B<will> match, it will B<not> set $1.
es: B<coincidirá>, pero B<no> actualizará $1.

# BEGIN blocks run FIFO during compilation. " }
source: BEGIN blocks run FIFO during compilation.\n" }
es: Los bloques BEGIN se ejecutan en orden FIFO durante la compilación.\n" }

source: BEGIN { *Some_package::foo = sub { ... } }
es: BEGIN { *Un_paquete::foo = sub { ... } }

source: BEGIN { require 'Module.pm'; 'Module'->import( LIST ); }
es: BEGIN { require 'Modulo.pm'; 'Modulo'->import(LISTA); }

source: BEGIN { require 'Module.pm'; 'Module'->import; }
es: BEGIN { require 'Modulo.pm'; 'Modulo'->import; }

source: BEGIN { require 'Module.pm'; }
es: BEGIN { require 'Modulo.pm'; }

source: BUILD
es: COMPILACIÓN

source: Back before Perl had the XS system for connecting with C libraries, programmers used to get library constants by reading through the C header files.
es: Mucho antes de que existiera en Perl el sistema XS para conectar bibliotecas C, los programadores tenían que leer los archivos de encabezado de C para obtener las constantes de biblioteca.

source: Backreference to a named capture group.
es: Retrorreferencia a un grupo de captura con nombre.

# Backslashed metacharacters in Perl are alphanumeric, such as C<b>, C<w>, C< >.
source: Backslashed metacharacters in Perl are alphanumeric, such as C<\b>, C<\w>, C<\n>.
es: En Perl los metacaracteres con carácter de escape son alfanuméricos, como C<\b>, C<\w>, C<\n>.

source: Backtracking is often optimized internally, but the general principle outlined here is valid.
es: La vuelta atrás se suele optimizar internamente, pero el principio general sigue siendo válido.

source: Based on the Glossary of Programming Perl, Third Edition, by Larry Wall, Tom Christiansen & Jon Orwant.
es: Basado en el Glosario de Programming Perl, Tercera Edición, de Larry Wall, Tom Christiansen y Jon Orwant.

source: Be Awesome.
es: Pórtese bien.

source: Be aware that many files in the distribution are derivative--avoid patching them, because git won't see the changes to them, and the build process will overwrite them.
es: Tenga en cuenta que muchos de los archivos de la distribución están derivados, por lo que debe evitar aplicarles parches, ya que git no verá los cambios que les aplique y el proceso de compilación los sobrescribirá.

source: Be aware, however, that, when this construct is followed by a quantifier, it currently triggers a warning message under the C<use warnings> pragma or B<-w> switch saying it C<"matches null string many times in regex">.
es: Sin embargo, debe tener en cuenta que, cuando esta construcción va seguida de un cuantificador y el pragma C<use warnings> o la opción B<-w> están activos, actualmente muestra el mensaje de advertencia C<"matches null string many times in regex"> (se detecta la cadena nula muchas veces en la expresión regular).

source: Be careful when using the branch reset pattern in combination with named captures.
es: Tenga cuidado al utilizar el patrón de reinicio de rama en combinación con las capturas con nombre.

source: Be careful, though, to never combine text strings with binary strings.
es: No obstante, debe evitar combinar cadenas de texto con cadenas binarias.

source: Be consistent.
es: Sea coherente.

source: Be honest about possible disadvantages to your choice of Perl since any choice has trade-offs.
es: Sea honesto y admita posibles desventajas de elegir Perl. Al fin y al cabo, toda elección conlleva ventajas y desventajas.

source: Be nice.
es: Sea amable.

source: Because B<perldoc> does not run properly tainted, and is known to have security issues, when run as the superuser it will attempt to drop privileges by setting the effective and real IDs to nobody's or nouser's account, or -2 if unavailable.
es: Como B<perldoc> no usa comprobaciones de seguridad y se sabe que tiene vulnerabilidades, cuando se ejecuta como superusuario intentará ceder privilegios estableciendo los identificadores efectivo y real en la cuenta nobody o nouser, o en -2 si dichas cuentas no están disponibles.

source: Because C<$body> is now a byte string, C<length> will report the number of bytes, instead of the number of characters.
es: Como C<$cuerpo_texto> es una cadena de bytes, C<length> devolverá el número de bytes, en lugar del número de caracteres.

source: Because C<DESTROY> methods can be called at any time, you should localize any global variables you might update in your C<DESTROY>.
es: Como los métodos C<DESTROY> pueden llamarse en cualquier momento, debe localizar cualquier variable global que pueda actualizarse mediante C<DESTROY>.

source: Because Perl allows subroutine names to be written as barewords, Perl has to guess whether the bareword after the method is a class name or subroutine name.
es: Puesto que Perl permite usar palabras sueltas como nombres de subrutinas, debe adivinar si dichas palabras a continuación del método aluden a un nombre de clase o de subrutina.

source: Because Perl allows you to use barewords for package names and subroutine names, it sometimes interprets a bareword's meaning incorrectly.
es: Puesto que Perl permite usar palabras sueltas como nombres de paquetes y subrutinas, a veces se interpreta de forma incorrecta el significado de alguna de estas palabras.

source: Because UTF-8 is one of Perl's internal formats, you can often just skip the encoding or decoding step, and manipulate the UTF8 flag directly.
es: Como UTF-8 es uno de los formatos internos de Perl, a menudo puede omitir el paso de codificar o descodificar, y manipular la marca UTF8 directamente.

source: Because a C<BEGIN> code block executes immediately, it can pull in definitions of subroutines and such from other files in time to be visible to the rest of the compile and run time.
es: Puesto que el bloque de código C<BEGIN> se ejecuta inmediatamente, puede obtener definiciones de subrutinas, etc. de otros archivos a tiempo para que sean visibles en tiempo de compilación y ejecución.

source: Because of the automatic conversion of scalars, operations that return scalars don't need to care (and in fact, cannot care) whether their caller is looking for a string, a number, or a reference.
es: Como la conversión de escalares es automática, las operaciones que los devuelven no necesitan tener en cuenta (y, de hecho, no pueden hacerlo) si el autor de la llamada espera una cadena, un número o una referencia.

source: Because of the unexpected behaviors associated with this modifier, you probably should only use it to maintain weird backward compatibilities.
es: A causa de los comportamientos inesperados asociados con este modificador, es probable que solo deba utilizarlo para mantener la compatibilidad con versiones anteriores en casos raros.

source: Because patterns are processed as double-quoted strings, the following also work:
es: Puesto que los patrones se procesan como cadenas entre comillas dobles, lo que sigue también funciona:

source: Because the C<use> statement implies a C<BEGIN> block, the importing of semantics happens as soon as the C<use> statement is compiled, before the rest of the file is compiled.
es: Como la instrucción C<use> implica la presencia de un bloque C<BEGIN>, la importación de semántica tiene lugar tan pronto como se haya compilado la instrucción C<use>, antes de que se compile el resto del archivo.

source: Because the internal format is often UTF-8, these bugs are hard to spot, because UTF-8 is usually the encoding you wanted!
es: Como el formato interno suele ser UTF-8, es difícil detectar estos errores (puesto que normalmente la codificación deseada es UTF-8).

source: Because the old-fashioned syntax is still supported for backwards compatibility, if you try to use a string like C<"This is $owner's house">, you'll be accessing C<$owner::s>; that is, the $s variable in package C<owner>, which is probably not what you meant.
es: Puesto que la sintaxis antigua todavía se admite por compatibilidad con las versiones anteriores, si intenta usar una cadena como C<"Vamos a cenar en $Gino's">, se accederá a C<$Gino::s>; es decir, la variable $s del paquete C<Gino>, que seguramente no sea lo que desea.

source: Because these are not part of the standard distribution, they may and in fact do differ from the base perl port in a variety of ways.
es: Como no forman parte de la distribución estándar, es posible que existan diferencias (de hecho, existen) con respecto a la versión básica de perl en diversos aspectos.

source: Because variable references always start with '$', '@', or '%', the "reserved" words aren't in fact reserved with respect to variable names.
es: Puesto que los nombres de variables siempre empiezan por "$", "@" o "%", las palabras "reservadas", de hecho, no están reservadas con respecto a los nombres de variables.

source: Because variables are accessed through the typeglob, you can use C<*foo = *bar> to create an alias which can be localized.
es: Como el acceso a las variables se realiza a través del I<typeglob>, puede usar C<*foo = *bar> para crear un alias que se pueda localizar

source: Because we don't have special variable types, and Perl needs to know whether to sort numerically (where 99 is less than 100) or alphabetically (where 100 comes before 99).
es: Porque Perl no distingue el tipo del contenido de las variables y tiene que determinar si debe ordenar numéricamente (99 menor que 100) o alfabéticamente (100 es anterior a 99).

source: Before Perl knew how to execute interpolated code within a pattern, this operation was completely safe from a security point of view, although it could raise an exception from an illegal pattern.
es: Antes de que Perl supiera cómo ejecutar código interpolado dentro de un patrón, esta operación era completamente segura, desde el punto de vista de la seguridad, aunque un patrón ilegal podía generar una excepción.

source: Before pushing I<any> local change to blead, it's incredibly important that you do a few things, lest other committers come after you with pitchforks and torches:
es: Antes de enviar un cambio local a blead, es muy importante que haga una serie de cosas (si no quiere que los demás colaboradores le persigan munidos de horcas de labrador y antorchas):

source: Before pushing any change to a maint version, make sure you've satisfied the steps in L</Committing to blead> above.
es: Antes de enviar cambios a la versión maint debe asegurarse de haber realizado los pasos descritos en L</Confirmar en blead> más arriba.

source: Before the first edition of I<Programming perl>, people commonly referred to the language as "perl", and its name appeared that way in the title because it referred to the interpreter.
es: Antes de la primera edición de I<Programming perl>, el lenguaje se solía llamar "perl", y su nombre aparecía así en el título porque hacía referencia al intérprete.

source: Before we even start scraping out the code, there are a few things we'll want to do in advance.
es: Antes de empezar a preparar el código debe hacer algunas cosas.

source: Before you panic, know that many people do use C<Moose> for command-line tools and other startup-sensitive code.
es: Antes de asustarse debe saber que mucha gente usa C<Moose> para construir herramientas de línea de comandos y código con necesidades específicas de tiempo de inicio.

source: Beginning is <I have 2 numbers: 53147>, number is <>.
es: El comienzo es <Tengo 2 números: 53147>, número es <>.

source: Begun in 1993 (see L<perlhist>), Perl version 5 is nearly a complete rewrite that provides the following additional benefits:
es: En 1993 (véase L<perlhist>) se lanzó Perl 5, prácticamente una reescritura completa del lenguaje, que proporciona las siguientes ventajas adicionales:

source: Being strings, and thus of arbitrary length, there is no practical limit for the exponent or number of decimal digits for these numbers.
es: Al ser cadenas y, por tanto, al tener una longitud arbitraria, no existe un límite práctico para el exponente o el número de dígitos decimales para estos números.

source: Besides being a cool trick, this means that you can extend C<Moose> using C<Moose> itself.
es: Además de ser un truco ingenioso, significa que puede extender C<Moose> mediante C<Moose>.

source: Besides being used internally during the build process of the Encode module, you can use F<enc2xs> to add your own encoding to perl.
es: F<enc2xs> se usa internamente durante el proceso de compilación del módulo Encode; también lo puede usar para agregar su propia codificación a perl.

source: Besides, you wouldn't want to distribute code that wasn't warning or strict-clean anyway, right?
es: Además, no querrá distribuir código que no respete los pragmas warnings y strict, ¿no?

source: Better yet, use the carefully constrained evaluation within a Safe compartment.
es: Una alternativa mejor es usar la evaluación minuciosamente limitada dentro de un compartimento de seguridad.

source: Beware of changing C<$?> by accident (e.g. by running something via C<system>).
es: Evite cambiar C<$?> accidentalmente (por ejemplo, ejecutando algo mediante C<system>).

source: Beware that if you put literal backslashes (those not inside interpolated variables) between C<\Q> and C<\E>, double-quotish backslash interpolation may lead to confusing results.
es: Tenga en cuenta que si pone barras diagonales inversas literales (no dentro de las variables interpoladas) entre C<\Q> y C<\E>, una interpolación con escape doble de barras diagonales inversas puede llevar a resultados confusos.

source: Beyond that, he has other preferences that aren't so strong:
es: Aparte de eso, Larry tiene otras preferencias menos estrictas:

source: Beyond that, you have to consider several things and decide which is best for you.
es: Si desea usar otras versiones, para decidir cuál es la que más le conviene debe tener en cuenta varias cosas, como las siguientes:

source: BinGOs 5.15.7 2012-Jan-20
es: BinGOs 5.15.7 2012-Ene-20

source: Binary distributions for some proprietary platforms can be found L<http://www.cpan.org/ports/> directory.
es: En el directorio L<http://www.cpan.org/ports/> encontrará distribuciones binarias para algunas plataformas comerciales.

source: Bits that the L</owner> of a file sets or unsets to allow or disallow access to other people.
es: Bits que el L</propietario> de un archivo establece o quita para permitir o prohibir el acceso a otras personas.

source: Blank lines between chunks that do different things.
es: Líneas en blanco entre fragmentos que hagan cosas distintas.

source: Both "fetch" filters remove the terminating NULL, and both "store" filters add a terminating NULL.
es: Los dos filtros "fetch" quitan el carácter NULL de terminación y los dos filtros "store" agregan un carácter NULL de terminación.
